In [1]:
import mysql.connector
from mysql.connector import Error
import pandas as pd

# Function to connect to server

In [2]:
def create_server_connection(host_name, user_name, user_password):
    connection = None
    try:
        connection = mysql.connector.connect(
            host=host_name,
            user=user_name,
            passwd=user_password
        )
        print("MySQL Database connection successful")
    except Error as err:
        print(f"Error: '{err}'")

    return connection

pw = "Rahul@112028"
connection = create_server_connection("localhost", "root", pw)

MySQL Database connection successful

# Function to create database connection

In [3]:
def create_db_connection(host_name, user_name, user_password, db_name):
    connection = None
    try:
        connection = mysql.connector.connect(
            host=host_name,
            user=user_name,
            passwd=user_password,
            database=db_name
        )
        print("MySQL Database connection successful")
    except Error as err:
        print(f"Error: '{err}'")

    return connection

# Function for Executing Queries

In [4]:
def execute_query(connection, query):
    cursor = connection.cursor()
    try:
        cursor.execute(query)
        connection.commit()
        print("Query successful")
    except Error as err:
        print(f"Error: '{err}'")

# Function for Reading data from Database

In [5]:
def read_query(connection, query):
    cursor = connection.cursor()
    result = None
    try:
        cursor.execute(query)
        result = cursor.fetchall()
        return result
    except Error as err:
        print(f"Error: '{err}'")

# Queries

Select employee from management department

In [8]:
Query = """
SELECT Emp_id, Name
FROM employee
WHERE department = "Management";
"""

connection = create_db_connection("localhost", "root", pw, "mydb")
results = read_query(connection, Query)

for result in results:
  print(result)

MySQL Database connection successful
(10004, 'Rita')
(10007, 'Rahul')
(10012, 'John')

query to retrieve all rows of employee table whose total salary is less than 15000 using WHERE

In [10]:
Query2 = '''
SELECT * FROM employee
WHERE (Basic_salary + HRA + DA) < 15000;
'''

connection = create_db_connection("localhost", "root", pw, "mydb")
results = read_query(connection, Query2)

for result in results:
  print(result)

MySQL Database connection successful
(10001, 'Riya', 'Sales', 7000, 200, 100)
(10008, 'Apoorva', 'Sales', 10000, 400, 300)
(10010, 'Mohit', 'Sales', 12000, 400, 150)
(10011, 'Suraj', 'Marketing', 14000, 300, 150)
(10013, 'Rita', 'Sales', 10000, 300, 200)
(10014, 'Apoorva', 'Sales', 12000, 400, 250)

query to retrieve employees working in Accounts and Sales department

In [11]:
Query3 = '''
SELECT Emp_id, Name
FROM employee
WHERE department IN ("Accounts", "Sales");
'''

connection = create_db_connection("localhost", "root", pw, "mydb")
results = read_query(connection, Query3)

for result in results:
  print(result)

MySQL Database connection successful
(10001, 'Riya')
(10002, 'Apoorva')
(10005, 'Ajay')
(10008, 'Apoorva')
(10009, 'Kunal')
(10010, 'Mohit')
(10013, 'Rita')
(10014, 'Apoorva')
(10015, 'Ajay')

query to retrieve employees in the Descending Order of their Basic salary using ORDER BY

In [12]:
Query4 = '''
SELECT *
FROM employee
ORDER BY Basic_salary DESC;
'''

connection = create_db_connection("localhost", "root", pw, "mydb")
results = read_query(connection, Query4)

for result in results:
  print(result)

MySQL Database connection successful
(10007, 'Rahul', 'Management', 30000, 1000, 800)
(10004, 'Rita', 'Management', 25000, 400, 200)
(10012, 'John', 'Management', 23000, 700, 500)
(10002, 'Apoorva', 'Accounts', 20000, 300, 200)
(10006, 'Riya', 'Marketing', 20000, 500, 400)
(10009, 'Kunal', 'Accounts', 18000, 500, 200)
(10003, 'Mohit', 'Marketing', 17000, 500, 300)
(10005, 'Ajay', 'Accounts', 15000, 350, 200)
(10011, 'Suraj', 'Marketing', 14000, 300, 150)
(10015, 'Ajay', 'Sales', 14000, 300, 800)
(10010, 'Mohit', 'Sales', 12000, 400, 150)
(10014, 'Apoorva', 'Sales', 12000, 400, 250)
(10008, 'Apoorva', 'Sales', 10000, 400, 300)
(10013, 'Rita', 'Sales', 10000, 300, 200)
(10001, 'Riya', 'Sales', 7000, 200, 100)

query to retrieve Departments whose Total salary is greater than 60000 using GROUP BY

In [15]:
Query5 = '''
SELECT Department
FROM employee 
GROUP BY Department 
HAVING SUM(Basic_salary + HRA + DA) > 60000;
'''

connection = create_db_connection("localhost", "root", pw, "mydb")
results = read_query(connection, Query5)

for result in results:
  print(result)

MySQL Database connection successful
('Sales',)
('Management',)

Query to retrieve employees whose Total salary(Basic_salary + HRA + DA) is in between 10000 to 20000 using BETWEEN and AND

In [16]:
Query6 = '''
select Emp_id, Name, Department, (Basic_salary + HRA + DA) as 'Total salary' 
FROM employee 
WHERE (Basic_salary + HRA + DA) between 10000 and 20000;
'''

connection = create_db_connection("localhost", "root", pw, "mydb")
results = read_query(connection, Query6)

for result in results:
  print(result)

MySQL Database connection successful
(10003, 'Mohit', 'Marketing', 17800)
(10005, 'Ajay', 'Accounts', 15550)
(10008, 'Apoorva', 'Sales', 10700)
(10009, 'Kunal', 'Accounts', 18700)
(10010, 'Mohit', 'Sales', 12550)
(10011, 'Suraj', 'Marketing', 14450)
(10013, 'Rita', 'Sales', 10500)
(10014, 'Apoorva', 'Sales', 12650)
(10015, 'Ajay', 'Sales', 15100)